import sympy as sp

λ, μ, ρ = sp.symbols('lyambda myu ro')

M = sp.Matrix([
    [0, 0, 0, -1/ρ, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, -1/ρ, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, -1/ρ, 0, 0, 0],
    [-(λ + 2*μ), 0, 0, 0, 0, 0, 0, 0, 0],
    [0, -μ, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, -μ, 0, 0, 0, 0, 0, 0],
    [-λ, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0],
    [-λ, 0, 0, 0, 0, 0, 0, 0, 0]])

ev = M.eigenvals()
for ev, multiplicity in ev.items():
    print(f"{ev}: кратность {multiplicity}")
